app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("message", "created_at", "updated_at", "completed") VALUES (?, ?, ?, ?)  [["message", "hi"], ["created_at", "2023-07-15 19:57:14.180160"], ["updated_at", "2023-07-15 19:57:14.180160"], ["completed", 0]]
---
  def create
    @task = Task.new(task_params)

    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
  def destroy
    @resource = Task.find(params[:id])
    @resource.destroy